const persianGenreNames: Record<number, string> = {
  12: "ماجراجویی", 14: "فانتزی", 16: "انیمیشن", 18: "درام", 27: "ترسناک", 28: "اکشن",
  35: "کمدی", 36: "تاریخی", 37: "وسترن", 53: "هیجان‌انگیز", 80: "جنایی", 99: "مستند",
  878: "علمی‌تخیلی", 9648: "معمایی", 10402: "موسیقی", 10749: "عاشقانه", 10751: "خانوادگی",
  10752: "جنگی", 10759: "اکشن و ماجراجویی", 10762: "کودکان", 10763: "اخبار",
  10764: "واقع‌نما", 10765: "علمی‌تخیلی و فانتزی", 10766: "آبکی", 10767: "گفت‌وگو",
  10768: "جنگ و سیاست", 10770: "فیلم تلویزیونی",
};

export function persianGenreName(id: number, fallback: string) {
  return persianGenreNames[id] || fallback;
}
